#! python
# coding=utf-8
# ********************************************************
# L_001_009.py
# 001.Разогрев
# 009.Функции модуля math
# --------------------------------------------------------
# Практический Курс по Продвинутому Python (2023)
# https://www.udemy.com/course/avecoder-advanced-python/
# Ave Coder, 2023
# ********************************************************
# Writing by sgiman, May 2025

# coding=utf-8
# ********************************************************
# L_001_001.py
# 001.Разогрев
# 001.Знакомство с модулем math
# --------------------------------------------------------
# Практический Курс по Продвинутому Python (2023)
# Ave Coder, 2023
# ********************************************************
# Writing sgiman, 2025 May

import math

print(math.factorial(5))    # FACTORIAL
print(math.sqrt(121))       # SQRT
print('-' * 80)

# Радиан - это длина дуги значение которой котрой равно радиусу
print('ГРАДУСЫ->РАДИАНЫ (360): ', math.radians(360))            # градусы в радианы
print(math.pi * 2)
print('РАДИАНЫ->ГРАДУСЫ (PI*2): ', math.degrees(math.pi * 2))   # радианы в градусы
print('-' * 80)

# Наибольший общий делитель (GCD)
print('GCD(52,8): ', math.gcd(52, 8))
print('GCD(8,52): ', math.gcd(8, 52))
print('-' * 80)

print('POW(5,2): ', pow(5, 2))    # степень 5 в 2
print('POW(2,5): ', pow(2, 5))    # степень 2 в 5
print('-' * 80)

