#! python
# coding=utf-8
# **************************************************************
# L_011_001.py
# 011_Рекурсия
# 001.Знакомство с Рекурсией
# --------------------------------------------------------------
# Практический Курс по Продвинутому Python (2023)
# https://www.udemy.com/course/avecoder-advanced-python/
# Ave Coder, 2023
# **************************************************************
# Writing by sgiman, May 2025

# --------------------------------------------------------------
# Рекурсия - это способ вызова функции самой себя:
# def f()
#   return f()
# --------------------------------------------------------------
# def climb_stairs(n):
#     if n <= 1:
#         return 1
#     return clib_stairs(n-1) + climb_stairs(n-2)
# --------------------------------------------------------------

