#! python
# coding=utf-8
# ********************************************************
# L_004_001.py
# 004.Дата и Время
# 001.Модуль Datetime
# --------------------------------------------------------
# Практический Курс по Продвинутому Python (2023)
# https://www.udemy.com/course/avecoder-advanced-python/
# Ave Coder, 2023
# ********************************************************
# Writing by sgiman, May 2025

from datetime import date, time, datetime

#-----------------------------------------------------
# Текущая дата
#-----------------------------------------------------
print('-' * 80)
d1 = date.today()
print(d1)
print('-' * 80)

#-----------------------------------------------------
# Установить время
#-----------------------------------------------------
t1 = time(6,30, 0)
print(t1)
print('-' * 80)

# Текущая дата и время
dt1 = datetime.now()
print(dt1)
print('-' * 80)

#-----------------------------------------------------
# СВОЙСТВА (properties)
#-----------------------------------------------------
print(d1.day)
print(d1.year)

print(t1.hour)

#-----------------------------------------------------
# Понедельник Понеділок
# Вторник Вівторок
# Среда Середа
# Четверг Четвер
# Пятница П'ятниця
# Суббота Субота
# Воскресенье Неділя
# Неделя Тиждень
#-----------------------------------------------------
print(dt1.month)
print(dt1.weekday())
print('-' * 80)

#days = ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Субота", "Воскресенье"]
#days = ["Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця", "Субота", "Неділя"]
days = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]

print(dt1.month)
print(dt1.weekday())        # номер дня недели
print(days[dt1.weekday()])  # название дня недели
print('-' * 80)

#-----------------------------------------------------
# ИЗМЕНИТЬ
#-----------------------------------------------------
d1 = d1.replace(year=2020, month=6, day=24)
t1 = t1.replace(hour=12)
dt1 = dt1.replace(year=2051, month=7)
print(d1)
print(t1)
print(dt1)

print('-' * 80)
