#! python
# coding=utf-8
# ********************************************************
# L_004_041_2.py
# 004.Дата и Время
# 041.Таймеры (Замеряем Время Выполнения Кода)
# --------------------------------------------------------
# Практический Курс по Продвинутому Python (2023)
# https://www.udemy.com/course/avecoder-advanced-python/
# Ave Coder, 2023
# ********************************************************
# Writing by sgiman, May 2025

import time
from Timer import Timer

t = Timer()
t.start()       # запустить таймер
time.sleep(2)   # задержка на 2 сек.
t.finish()      # остановить таймер
